In [88]:
True == False
True != 0
False == 0
True or False
1 == '1'

False

In [89]:
eng = 'Korea COVID 19'
eng.lower()
eng.upper()

'KOREA COVID 19'

In [90]:
data = []
data.append('java')
data[0], data[-1], data[1:], data[:2]
data.sort()
data.reverse()

In [91]:
b=(1,2,3,'사','오')
c=1,2,3
type(b), type(c)
b[3] = 4
b[3:], b[1:4]

TypeError: 'tuple' object does not support item assignment

In [92]:
dic = {'name1':'경민', '학번1':20103, 'name2':'경민2', '학번2':20104}
dic.get('name1')
dic.keys()
dic.values()

dict_values(['경민', 20103, '경민2', 20104])

In [93]:
lunch = {'햄버거', '치킨', '라면', '콜라', 10000}
dinner = {'피자', '족발', '라면', '콜라', 10000}
lunch & dinner
dinner | lunch

{10000, '라면', '족발', '치킨', '콜라', '피자', '햄버거'}

In [94]:
import pandas as pd
s1 = pd.core.series.Series([1,2,3])
s2 = pd.core.series.Series(['일','이','삼'])
pd.DataFrame(data = dict(num=s1, word=s2))

   num word
0    1    일
1    2    이
2    3    삼

In [95]:
num_se = pd.Series([1,2,3,4,5])
num_df = pd.DataFrame([1,2,3,4,5], index=[1,2,3,4,5])

In [96]:
man = [
    {'name':'은주', 'age':20, 'job':'j1'},
    {'name':'민서', 'age':30, 'job':'j2'},
    {'name':'경민', 'age':15, 'job':'j1'}
]
df = pd.DataFrame(man, index=[1,2,3])
df

  name  age job
1   은주   20  j1
2   민서   30  j2
3   경민   15  j1

In [98]:
person = [
    ['a', 100, 80], ['b', 17, 60], ['b', 50, 40], ['d', 90, 80]
]
col_name=['name', '국어', '영어']
df = pd.DataFrame.from_records(person, columns=col_name, index=[1,2,3,4])

df[['국어', '영어']]>70

      국어     영어
1   True   True
2  False  False
3  False  False
4   True   True

In [118]:
yourmom = [
    {'학번':'30102', 'Java':90, 'Python':30, 'C':50, '합계':90+30+50},
    {'학번':'30201', 'Java':100, 'Python':100, 'C':90, '합계':100+100+90},
    {'학번':'30303', 'Java':80, 'Python':100, 'C':70, '합계':80+100+70},
    {'학번':'30501', 'Java':70, 'Python':100, 'C':100, '합계':70+100+100}
]
pd.DataFrame(yourmom, index=['','','',''])

     학번  Java  Python    C   합계
  30102    90      30   50  170
  30201   100     100   90  290
  30303    80     100   70  250
  30501    70     100  100  270

In [123]:
Fkschool = [
    {'교시':'1교시', 'C':10, 'R':10, 'JAVA':10},
    {'교시':'2교시', 'C':10, 'R':10, 'JAVA':10},
    {'교시':'3교시', 'C':10, 'R':10, 'JAVA':10},
    {'교시':'4교시', 'C':10, 'R':10, 'JAVA':10},
    {'교시':'5교시', 'C':10, 'R':10, 'JAVA':10}
]
pd.DataFrame(Fkschool, index=['','','','',''])

   교시   C   R  JAVA
  1교시  10  10    10
  2교시  10  10    10
  3교시  10  10    10
  4교시  10  10    10
  5교시  10  10    10